Revit 2026 API
FamilyItemFactory.NewLinearDimension(View, Line, ReferenceArray) Method
 Generate a new linear dimension object using the default dimension type.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Dimension NewLinearDimension(
	View view,
	Line line,
	ReferenceArray references
)
Public Function NewLinearDimension (
	view As View,
	line As Line,
	references As ReferenceArray
) As Dimension
public:
Dimension^ NewLinearDimension(
	View^ view,
	Line^ line,
	ReferenceArray^ references
)
member NewLinearDimension :
        view : View *
        line : Line *
        references : ReferenceArray -> Dimension
Parameters
view View
 The view in which the dimension is to be visible.
line Line
 The extension line of the dimension.
references ReferenceArray
 An array of geometric references to which the dimension is to be bound. You must supply at least two references, and all references supplied must be parallel to each other and perpendicular to the extension line.
Return Value
Dimension
If creation was successful the new linear dimension is returned, otherwise an exception with failure information will be thrown.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when any input argument is null.
ArgumentException |  Thrown when the argument "references" is invalid.
InvalidOperationException |  Thrown when the creation failed.
Remarks
 The currently user set default style is used for the created dimension.
See Also
Reference
FamilyItemFactory Class
NewLinearDimension Overload
Autodesk.Revit.Creation Namespace